In [55]:
# Pyber Challenge

In [56]:
### 4.3 Loading and Reading CSV files

In [57]:
# Add Matplotlib inline magic command
%matplotlib inline
# Dependencies and Setup
import matplotlib.pyplot as plt
import pandas as pd
import numpy as np

In [58]:
# File to Load (Remember to change these)
city_data_to_load = "Resources/city_data.csv"
ride_data_to_load = "Resources/ride_data.csv"

In [59]:
# Read the City and Ride Data
city_data_df = pd.read_csv(city_data_to_load)
ride_data_df = pd.read_csv(ride_data_to_load)

In [60]:
### Merge the DataFrames

In [61]:
# Combine the data into a single dataset
pyber_data_df = pd.merge(ride_data_df, city_data_df, how="left", on=["city", "city"])

In [62]:
# Display the data table for preview
pyber_data_df.head()

,city,date,fare,ride_id,driver_count,type
0,Lake Jonathanshire,2019-01-14 10:14:22,13.83,5739410935873,5,Urban
1,South Michelleport,2019-03-04 18:24:09,30.24,2343912425577,72,Urban
2,Port Samanthamouth,2019-02-24 04:29:00,33.44,2005065760003,57,Urban
3,Rodneyfort,2019-02-10 23:22:03,23.44,5149245426178,34,Urban
4,South Jack,2019-03-06 04:28:35,34.58,3908451377344,46,Urban

In [63]:
## Deliverable 1: Get a Summary DataFrame

In [64]:
#  1. Get the total rides for each city type
ttl_rides_by_city_type = pyber_data_df.groupby("type")["ride_id"].count()
ttl_rides_by_city_type

type
Rural        125
Suburban     625
Urban       1625
Name: ride_id, dtype: int64

In [65]:
# 2. Get the total drivers for each city type
ttl_drivers_by_city_type = pyber_data_df.groupby(["type","city"])["driver_count"].first().groupby("type").sum()
#ttl_drivers_by_city_type = pyber_data_df.groupby("type")["driver_count"].sum()
#ttl_drivers_by_city_type = pyber_data_df.groupby("type")["driver_count":"city"].sum()
ttl_drivers_by_city_type

type
Rural         78
Suburban     490
Urban       2405
Name: driver_count, dtype: int64

In [66]:
#  3. Get the total amount of fares for each city type
ttl_fares_by_city_type = pyber_data_df.groupby("type")["fare"].sum()
ttl_fares_by_city_type

type
Rural        4327.93
Suburban    19356.33
Urban       39854.38
Name: fare, dtype: float64

In [67]:
#  4. Get the average fare per ride for each city type.
avg_fare_per_ride = ttl_fares_by_city_type / ttl_rides_by_city_type
avg_fare_per_ride

type
Rural       34.623440
Suburban    30.970128
Urban       24.525772
dtype: float64

In [68]:
# 5. Get the average fare per driver for each city type
avg_fare_per_driver = ttl_fares_by_city_type / ttl_drivers_by_city_type
avg_fare_per_driver

type
Rural       55.486282
Suburban    39.502714
Urban       16.571468
dtype: float64

In [69]:
#  6. Create a PyBer summary DataFrame.
pyber_summary_df = pd.DataFrame({
    "Total Rides": ttl_rides_by_city_type,
    "Total Drivers": ttl_drivers_by_city_type,
    "Total Fares": ttl_fares_by_city_type,
    "Average Fare per Ride": avg_fare_per_ride,
    "Average Fare per Driver": avg_fare_per_driver})
pyber_summary_df

,Total Rides,Total Drivers,Total Fares,Average Fare per Ride,Average Fare per Driver
type,,,,,
Rural,125,78,4327.93,34.623440,55.486282
Suburban,625,490,19356.33,30.970128,39.502714
Urban,1625,2405,39854.38,24.525772,16.571468

In [70]:
#  7. Cleaning up the DataFrame. Delete the index name
pyber_summary_df.index.name = None

In [71]:
#  8. Format the columns.
#avg_fare_per_ride = avg_fare_per_ride.map("{:.2f}".format)
#avg_fare_per_driver = avg_fare_per_driver.map("{:.2f}".format)
#pyber_summary_df = avg_fare_per_driver.map("{:.2f}".format)
#pyber_summary_df.["Average Fare per Ride"].map("{:.2f}".format)
#pyber_summary_df = pyber_summary_df["Average Fare per Ride"].map("{:.2f}".format)
#pyber_summary_df

pyber_summary_da

Rural       34.62
Suburban    30.97
Urban       24.53
Name: Average Fare per Ride, dtype: object

In [72]:
## Deliverable 2.  Create a multiple line plot that shows the total weekly of the fares for each type of city.

In [73]:
# 9. Using groupby() on the pyber_data_df to create a new DataFrame showing the sum of the fares 
#  for each date where the indices are the city type and date.
#ttl_fare_per_date = pyber_data_df[["type", "date"]].groupby('type").("fare").sum()
# df.groupby(['Fruit','Name'])['Number'].sum()  
ttl_fare_per_date = pyber_data_df.groupby(['type','date'])["fare"].sum().reset_index()
ttl_fare_per_date
# print(type(ttl_fare_per_date))

       type                 date   fare
0     Rural  2019-01-01 09:45:36  43.69
1     Rural  2019-01-02 11:18:32  52.12
2     Rural  2019-01-03 19:51:01  19.90
3     Rural  2019-01-04 03:31:26  24.88
4     Rural  2019-01-06 07:38:40  47.33
...     ...                  ...    ...
2370  Urban  2019-05-08 04:20:00  21.99
2371  Urban  2019-05-08 04:39:49  18.45
2372  Urban  2019-05-08 07:29:01  18.55
2373  Urban  2019-05-08 11:38:35  19.77
2374  Urban  2019-05-08 13:10:18  18.04

[2375 rows x 3 columns]

In [74]:
# 10. Reset the index on the DataFrame you created in #1. This is needed to use the 'pivot()' function.
ttl_fare_per_date = ttl_fare_per_date.reset_index()

In [75]:
# 11. Create a pivot table with the 'date' as the index, the columns ='type', and values='fare' 
# to get the total fares for each type of city by the date. 
ttl_fare_per_date = ttl_fare_per_date.pivot(index="date", columns="type", values="fare")
ttl_fare_per_date.head(10)
#ttl_fare_per_date = df.pivot(index="date", columns="type", value="fare")

type                 Rural  Suburban  Urban
date
2019-01-01 00:08:16    NaN       NaN  37.91
2019-01-01 00:46:46    NaN     47.74    NaN
2019-01-01 02:07:24    NaN     24.07    NaN
2019-01-01 03:46:50    NaN       NaN   7.57
2019-01-01 05:23:21    NaN       NaN  10.75
2019-01-01 09:45:36  43.69       NaN    NaN
2019-01-01 12:32:48    NaN     25.56    NaN
2019-01-01 14:40:14    NaN       NaN   5.42
2019-01-01 14:42:25    NaN       NaN  12.31
2019-01-01 14:52:06    NaN     31.15    NaN

In [76]:
print (ttl_fare_per_date.index)

Index(['2019-01-01 00:08:16', '2019-01-01 00:46:46', '2019-01-01 02:07:24',
       '2019-01-01 03:46:50', '2019-01-01 05:23:21', '2019-01-01 09:45:36',
       '2019-01-01 12:32:48', '2019-01-01 14:40:14', '2019-01-01 14:42:25',
       '2019-01-01 14:52:06',
       ...
       '2019-05-07 20:05:15', '2019-05-07 20:22:19', '2019-05-07 20:40:29',
       '2019-05-08 01:54:18', '2019-05-08 02:31:25', '2019-05-08 04:20:00',
       '2019-05-08 04:39:49', '2019-05-08 07:29:01', '2019-05-08 11:38:35',
       '2019-05-08 13:10:18'],
      dtype='object', name='date', length=2375)

In [77]:
# # 12. Create a new DataFrame from the pivot table DataFrame using loc on the given dates, '2018-01-01':'2018-04-29'.
ttl_fare_jan_apr_df = ttl_fare_per_date.loc[(ttl_fare_per_date.index > '2019-01-01') & (ttl_fare_per_date.index <= '2019-04-30')]
ttl_fare_jan_apr_df.head(10)

type                 Rural  Suburban  Urban
date
2019-01-01 00:08:16    NaN       NaN  37.91
2019-01-01 00:46:46    NaN     47.74    NaN
2019-01-01 02:07:24    NaN     24.07    NaN
2019-01-01 03:46:50    NaN       NaN   7.57
2019-01-01 05:23:21    NaN       NaN  10.75
2019-01-01 09:45:36  43.69       NaN    NaN
2019-01-01 12:32:48    NaN     25.56    NaN
2019-01-01 14:40:14    NaN       NaN   5.42
2019-01-01 14:42:25    NaN       NaN  12.31
2019-01-01 14:52:06    NaN     31.15    NaN

In [78]:
# 13. Set the "date" index to datetime datatype. This is necessary to use the resample() method in Step 8.
ttl_fare_jan_apr_df.index = pd.to.datetime(ttl_fare_jan_apr_df.index)
#df.index = pd.to_datetime(df.index)

AttributeError: module 'pandas' has no attribute 'to'

In [ ]:
# 14. Check that the datatype for the index is datetime using df.info()
ttl_fare_jan_apr_df(date).info()

In [ ]:
# 15. Create a new DataFrame using the "resample()" function by week 'W' and get the sum of the fares for each week.
ttl_fare_jan_apr_week = ttl_fare_jan_apr_pivot.resample("W").sum()
ttl_fare_jan_apr_week.head()

In [ ]:
# 16. Using the object-oriented interface method, plot the resample DataFrame using the df.plot() function.

In [ ]:
# Import the style from Matplotlib.
from matplotlib import style
# Use the graph style fivethirtyeight.
style.use('fivethirtyeight')